<?php

// 消費税
define( '_TAX', 1.08 );

//----------------------------------------------------------------------------
// 関数名：cal_tax
// 引  数：$price - 金額
// 戻り値：税込み価格
// 内  容：税込み価格を計算する。
//----------------------------------------------------------------------------
function cal_tax( $price ) {
	return floor( $price * _TAX );
}

//----------------------------------------------------------------------------
// 関数名：cal_no_tax
// 引  数：$price - 金額
// 戻り値：税抜き価格
// 内  容：税抜き価格を計算する。
//----------------------------------------------------------------------------
function cal_no_tax( $price ) {
	return ceil( $price / _TAX );
}
?>
